Revit 2026 API

# ExtrusionSketch Property

---

Returns the Sketch of the Extrusion.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Sketch Sketch { get; }
```
```vb
Public ReadOnly Property Sketch As Sketch
	Get
```
```cpp
public:
property Sketch^ Sketch {
	Sketch^ get ();
}
```
```fsharp
member Sketch : Sketch with get
```

#### Property Value

Sketch

This property is used to retrieve the Sketches of the Extrusion.

#### Reference

Extrusion Class

Autodesk.Revit.DB Namespace